#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG]
azurerm_sql_server.sqldb: Refreshing state... [id=/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG/providers/Microsoft.Sql/servers/terraform-sqlserver-010203]
azurerm_app_service_plan.sp: Refreshing state... [id=/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG/providers/Microsoft.Web/serverfarms/example-appservice-plan]
azurerm_sql_database.db: Refreshing state... [id=/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG/providers/Microsoft.Sql/servers/terraform-sqlserver-010203/databases/ProductsDB]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service.aps will be created
  + resource "azurerm_app_service" "aps" {
      + app_service_plan_id               = "/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG/providers/Microsoft.Web/serverfarms/example-appservice-plan"
      + app_settings                      = {
          + "SOME_KEY" = "some-value"
        }
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "westeurope"
      + name                              = "terraform-app-1510611"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "WebAppSqlRG"
      + site_credential                   = (known after apply)

      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + site_config {
          + acr_use_managed_identity_credentials = false
          + always_on                            = false
          + dotnet_framework_version             = "v4.0"
          + ftps_state                           = (known after apply)
          + http2_enabled                        = false
          + ip_restriction                       = (known after apply)
          + linux_fx_version                     = (known after apply)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + remote_debugging_enabled             = false
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = "LocalGit"
          + scm_use_main_ip_restriction          = false
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)
        }
    }

  # azurerm_sql_database.db must be replaced
-/+ resource "azurerm_sql_database" "db" {
      ~ collation                        = "SQL_Latin1_General_CP1_CI_AS" -> (known after apply)
      ~ creation_date                    = "2023-09-30T11:40:32.063Z" -> (known after apply)
      ~ default_secondary_location       = "North Europe" -> (known after apply)
      ~ edition                          = "GeneralPurpose" -> (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      ~ id                               = "/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG/providers/Microsoft.Sql/servers/terraform-sqlserver-010203/databases/ProductsDB" -> (known after apply)
      ~ max_size_bytes                   = "34359738368" -> (known after apply)
      + max_size_gb                      = (known after apply)
        name                             = "ProductsDB"
      ~ requested_service_objective_id   = "f21733ad-9b9b-4d4e-a4fa-94a133c41718" -> (known after apply)
      ~ requested_service_objective_name = "GP_Gen5_2" -> (known after apply)
      + restore_point_in_time            = (known after apply)
      ~ server_name                      = "terraform-sqlserver-010203" -> "terraform-sqlserver-1510611" # forces replacement
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
        tags                             = {
            "environment" = "production"
        }
      - zone_redundant                   = false -> null
        # (4 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = "Disabled" -> null
          - email_addresses      = [] -> null
          - retention_days       = 0 -> null
          - state                = "Disabled" -> null
        }
    }

  # azurerm_sql_server.sqldb must be replaced
-/+ resource "azurerm_sql_server" "sqldb" {
      ~ fully_qualified_domain_name  = "terraform-sqlserver-010203.database.windows.net" -> (known after apply)
      ~ id                           = "/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG/providers/Microsoft.Sql/servers/terraform-sqlserver-010203" -> (known after apply)
      ~ name                         = "terraform-sqlserver-010203" -> "terraform-sqlserver-1510611" # forces replacement
        tags                         = {
            "environment" = "production"
        }
        # (6 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [
              - "",
            ] -> null
          - email_account_admins = false -> null
          - email_addresses      = [
              - "",
            ] -> null
          - retention_days       = 0 -> null
          - state                = "Disabled" -> null
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + app_service_hostname  = (known after apply)
  + app_service_ipaddress = (known after apply)
  ~ sql_server_id         = "/subscriptions/ff1d424e-36cd-400a-ba00-d801cb0bf0a4/resourceGroups/WebAppSqlRG/providers/Microsoft.Sql/servers/terraform-sqlserver-010203" -> (known after apply)

Warning: Deprecated Resource

  with azurerm_app_service_plan.sp,
  on main.tf line 21, in resource "azurerm_app_service_plan" "sp":
  21: resource "azurerm_app_service_plan" "sp" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @RehabAbotalep, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure with Terraform`*